app/Helpers/global_helper.php

    function barang_masuk($id)
    {
        $db = \Config\Database::connect();
        return $db->table('tb_pbarangmasuk')->select('tb_pbarangmasuk.*,s.nama_toko, b.nama_barang')
            ->join('tb_barang b', 'b.id_barang = tb_pbarangmasuk.id_barang')
            ->join('tb_supplier s', 'tb_pbarangmasuk.id_supplier = s.id_supplier')->orderBy('b.nama_barang', 'ASC')->where('tb_pbarangmasuk.id_barang', $id)->get()->getResult();
---
SELECT `tb_pbarangmasuk`.*, `s`.`nama_toko`, `b`.`nama_barang`
FROM `tb_pbarangmasuk`
JOIN `tb_barang` `b` ON `b`.`id_barang` = `tb_pbarangmasuk`.`id_barang`
JOIN `tb_supplier` `s` ON `tb_pbarangmasuk`.`id_supplier` = `s`.`id_supplier`
WHERE `tb_pbarangmasuk`.`id_barang` = '6'
ORDER BY `b`.`nama_barang` ASC