app/Controllers/BarangMasuk.php

SELECT COUNT(*) AS `numrows`
FROM `tb_pbarangmasuk`
JOIN `tb_barang` `b` ON `b`.`id_barang` = `tb_pbarangmasuk`.`id_barang`
JOIN `tb_supplier` `s` ON `tb_pbarangmasuk`.`id_supplier` = `s`.`id_supplier`
WHERE `nama_supplier` LIKE '%dada%' ESCAPE '!'
OR  `nama_barang` LIKE '%dada%' ESCAPE '!'
SELECT `tb_pbarangmasuk`.*, `s`.`nama_supplier`, `b`.`nama_barang`
FROM `tb_pbarangmasuk`
JOIN `tb_barang` `b` ON `b`.`id_barang` = `tb_pbarangmasuk`.`id_barang`
JOIN `tb_supplier` `s` ON `tb_pbarangmasuk`.`id_supplier` = `s`.`id_supplier`
WHERE `nama_supplier` LIKE '%dada%' ESCAPE '!'
OR  `nama_barang` LIKE '%dada%' ESCAPE '!'
ORDER BY `tgl_pembelian` DESC
 LIMIT 10
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();

        $data = [
            'title' => 'Kelola Barang Masuk',
            // 'ruangans' => $this->ruangan->get_all_nama_ruangan(),
            // 'barangs' => $this->barang->get_all_nama_barang(),
            'barangmasuks' => $this->masuk->select('tb_pbarangmasuk.*,s.nama_supplier, b.nama_barang')
                ->join('tb_barang b', 'b.id_barang = tb_pbarangmasuk.id_barang')
                ->join('tb_supplier s', 'tb_pbarangmasuk.id_supplier = s.id_supplier')->orderBy('tgl_pembelian', 'DESC')->paginate(10, 'table'),
            'flash' => $this->session->getFlashdata('flash'),
            'pager' => $this->masuk->pager
        ];