app/Controllers/Barang.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();

        $data = [
            'title' => 'Kelola Barang',
            'barang' => $this->barang->orderBy('nama_barang', 'ASC')->paginate(8, 'card'),
            'pager' => $this->barang->pager
        ];
---
SELECT *
FROM `tb_barang`
ORDER BY `nama_barang` ASC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `tb_barang`

    public function pdf()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();

        $data = [
            'title' => 'Barang',
            'datas' => $this->barang->orderBy('nama_barang', 'ASC')->get()->getResult(),
---
SELECT *
FROM `tb_barang`
ORDER BY `nama_barang` ASC