app/Controllers/Gedung.php

    public function index()
    {
        $pager = \Config\Services::pager();

        $data = [
            'title' => 'Kelola Gedung',
            'gedung' => $this->gedung->orderBy('nama_gedung', 'ASC')->paginate(8, 'card'),
---
SELECT *
FROM `tb_gedung`
ORDER BY `nama_gedung` ASC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `tb_gedung`