app/Controllers/Gedung.php

SELECT *
FROM `tb_gedung`
ORDER BY `nama_gedung` ASC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `tb_gedung`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();
        $search_query = $this->request->getGet('search_query');
        if ($search_query) {
            $gedung = $this->gedung->like('nama_gedung', $search_query);
        } else {
            $gedung = $this->gedung;
        }
        $data = [
            'title' => 'Kelola Gedung',
            'gedung' => $gedung->orderBy('nama_gedung', 'ASC')->paginate(8, 'card'),