app/Controllers/Ruangan.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();

        $data = [
            'title' => 'Kelola Ruangan',
            'ruangan' => $this->ruangan->orderBy('nama_ruangan', 'ASC')->paginate(8, 'card'),
---
SELECT *
FROM `tb_ruangan`
ORDER BY `nama_ruangan` ASC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `tb_ruangan`