app/Controllers/Scan.php

SELECT *
FROM `tb_barang`
WHERE `id_barang` = '6'
---
    public function pdf($id)
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();

        $data = [
            'title' => 'Cetak QRCode',
            'barang' => $this->barang->where('id_barang', $id)->get()->getRow(),