app/Controllers/Supplier.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $pager = \Config\Services::pager();
        $search_query = $this->request->getGet('search_query');
        if ($search_query) {
            $supplier = $this->supplier->like('nama_supplier', $search_query);
        } else {
            $supplier = $this->supplier;
        }
        $data = [
            'title' => 'Kelola Supplier',
            'suppliers' => $supplier->orderBy('nama_supplier', 'ASC')->paginate(10, 'table'),
            'flash' => $this->session->getFlashdata('flash'),
            'pager' => $this->supplier->pager
        ];
---
SELECT *
FROM `tb_supplier`
ORDER BY `nama_supplier` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tb_supplier`
SELECT *
FROM `tb_supplier`
WHERE `nama_supplier` LIKE '%b%' ESCAPE '!'
ORDER BY `nama_supplier` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tb_supplier`
WHERE `nama_supplier` LIKE '%b%' ESCAPE '!'