app/Controllers/Supplier.php

SELECT *
FROM `tb_supplier`
ORDER BY `nama_toko` ASC
 LIMIT 10
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            // maka redirct ke halaman login
            return redirect()->to(base_url('auth'));
        }
        $currentPage = $this->request->getVar('page_table') ? $this->request->getVar('page_table') : 1;
        $pager = \Config\Services::pager();
        $search_query = $this->request->getGet('search_query');
        if ($search_query) {
            $supplier = $this->supplier->like('nama_toko', $search_query)->orlike('nama_supplier', $search_query);
        } else {
            $supplier = $this->supplier;
        }
        $data = [
            'title' => 'Kelola Supplier',
            'suppliers' => $supplier->orderBy('nama_toko', 'ASC')->paginate(10, 'table'),