app/Models/Barang_model.php

SELECT COUNT(*) AS `numrows`
FROM `tb_barang`
---
    public function count_all_barang()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_barang')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_barang`
WHERE `id_barang` = '6'
---
    public function is_barang_exist($id)
    {
        $this->db = \Config\Database::connect();
        return ($this->db->table('tb_barang')->where('id_barang', $id)->countAllResults() > 0) ? TRUE : FALSE;