app/Models/Gedung_model.php

SELECT COUNT(*) AS `numrows`
FROM `tb_gedung`
---
    public function count_all_gedung()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_gedung')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_gedung`
WHERE `id_gedung` = '6'
---
    public function is_gedung_exist($id)
    {
        $this->db = \Config\Database::connect();
        return ($this->db->table('tb_gedung')->where('id_gedung', $id)->countAllResults() > 0) ? TRUE : FALSE;

DELETE FROM `tb_gedung`
WHERE `id_gedung` = '3'
---
    public function delete_gedung($id)
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_gedung')->where('id_gedung', $id)->delete();