app/Models/Masuk_model.php

    public function count_all_masuk()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_pbarangmasuk')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tb_pbarangmasuk`