app/Models/Penyimpanan_model.php

SELECT COUNT(*) AS `numrows`
FROM `tb_menyimpan`
---
    public function count_all_menyimpan()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_menyimpan')->countAllResults();