app/Models/Ruangan_model.php

SELECT COUNT(*) AS `numrows`
FROM `tb_ruangan`
---
    public function count_all_ruangan()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_ruangan')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_ruangan` `r`
JOIN `tb_gedung` `g` ON `g`.`id_gedung` = `r`.`id_gedung`
WHERE `r`.`id_gedung` = '5'
---
    public function count_ruangan_in_gedung($id)
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_ruangan r')->select('r.*, r.id_user as Penambah, g.nama_gedung')->join('tb_gedung g', 'g.id_gedung = r.id_gedung')->where('r.id_gedung', $id)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_ruangan` `r`
JOIN `tb_barang` `b` ON `b`.`id_ruangan` = `r`.`id_ruangan`
WHERE `r`.`id_ruangan` = '9'
---
    public function count_barang_in_ruangan($id)
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_ruangan r')->select('r.*, r.id_user as Penambah')->join('tb_barang b', 'b.id_ruangan = r.id_ruangan')->where('r.id_ruangan', $id)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_ruangan`
WHERE `id_ruangan` = '9'
---
    public function is_ruangan_exist($id)
    {
        $this->db = \Config\Database::connect();
        return ($this->db->table('tb_ruangan')->where('id_ruangan', $id)->countAllResults() > 0) ? TRUE : FALSE;