app/Models/Supplier_model.php

SELECT COUNT(*) AS `numrows`
FROM `tb_supplier`
---
    public function count_all_supplier()
    {
        $this->db = \Config\Database::connect();
        return $this->db->table('tb_supplier')->countAllResults();